-- Engine
local S, C, L, DB = unpack(select(2, ...))

-- Variables
local debuffs = {
	[557] = {
		-- 德拉诺
		[1291] = {},
		[1211] = {},
		[1262] = {},
		[1452] = {}
	},
	[477] = {
		-- 悬槌堡
		["general"] = {},
		[1128] = {},
		[971] = {
			-- 屠夫
			156152, -- 龟裂创伤
			156147, -- 切肉刀
			156151 -- 捶肉槌
		},
		[1195] = {},
		[1196] = {},
		[1148] = {},
		[1153] = {},
		[1197] = {}
	},
	[457] = {
		-- 黑石铸造厂
		["general"] = {},
		[1202] = {},
		[1155] = {},
		[1122] = {},
		[1161] = {},
		[1123] = {},
		[1147] = {},
		[1154] = {},
		[1162] = {},
		[1203] = {},
		[959] = {}
	},
	[669] = {
		-- 地狱火堡垒
		["general"] = {},
		[1426] = {},
		[1425] = {},
		[1392] = {},
		[1432] = {},
		[1396] = {},
		[1372] = {},
		[1433] = {},
		[1427] = {},
		[1391] = {},
		[1447] = {},
		[1394] = {},
		[1395] = {},
		[1438] = {}
	},
	[547] = {
		-- 奥金顿
		["general"] = {},
		[1185] = {},
		[1186] = {},
		[1216] = {},
		[1225] = {}
	},
	[537] = {
		-- 影月墓地
		["general"] = {},
		[1139] = {},
		[1168] = {},
		[1140] = {},
		[1160] = {}
	},
	[536] = {
		-- 恐轨车站
		["general"] = {
			164192, -- 50000伏特（恐轨技师）
			176147, -- 点燃（格罗姆卡枪手）
			164241, -- 伤口出血（恐轨投弹手）
			166340 -- 雷霆区域
		},
		[1138] = {},
		[1163] = {
			-- 尼托格·雷塔
			160681, -- 火力压制
			166570, -- 熔渣冲击
			167038 -- 熔渣罐
		},
		[1133] = {
			-- 啸天者托瓦拉
			162065, -- 冰冻诱捕
			162057, -- 蚀骨之矛
			161588 -- 散射能量
		}
	},
	[556] = {
		-- 永茂林地
		["general"] = {},
		[1214] = {},
		[1207] = {},
		[1208] = {},
		[1209] = {},
		[1210] = {}
	},
	[385] = {
		-- 血槌炉渣矿井
		["general"] = {},
		[893] = {},
		[888] = {},
		[887] = {},
		[889] = {}
	},
	[476] = {
		-- 通天峰
		["general"] = {},
		[965] = {},
		[966] = {},
		[967] = {},
		[968] = {}
	},
	[558] = {
		-- 钢铁码头
		["general"] = {
			172771, -- 燃烧弹
			172889, -- 冲刺猛击
			164632, -- 燃烧箭
			164648, -- 倒刺箭幕
			172963, -- 破门斩斧
			173489, -- 熔岩喷薄
			158341, -- 龟裂创伤
			173105, -- 锁链旋风
			173149, -- 烈焰之箭
			173307 -- 倒钩长矛
		},
		[1235] = {
			-- 血肉撕裂者诺格加尔
			164504, -- 威吓
			164837, -- 野蛮重殴
			164734 -- 撕裂重击
		},
		[1236] = {
			-- 恐轨押运员
			163276, -- 筋腱撕裂
			163740 -- 污血
		},
		[1237] = {
			-- 奥舍尔
			162415, -- 进食时间
			178156 -- 酸液溅射
		},
		[1238] = {
			-- 斯古洛克
			168398 -- 急速射击瞄准
		}
	},
	[559] = {
		-- 黑石塔上层
		["general"] = {},
		[1226] = {},
		[1227] = {},
		[1228] = {},
		[1229] = {},
		[1234] = {}
	}
}

-- Event
local function OnInitialize(self, event, ...)
	C.UnitFrame = C.UnitFrame or {}
	C.UnitFrame.RaidAuras = C.UnitFrame.RaidAuras or {}
end

local function OnPlayerLogin(self, event, ...)
	local num = 19999
	local auras = C.UnitFrame.RaidAuras
	local k1, v1, k2, v2, k3, v3 = nil, nil, nil, nil, nil, nil

	for k1, v1 in pairs(debuffs) do
		for k2, v2 in pairs(v1) do
			for k3, v3 in pairs(v2) do
				num = num - 1
				auras[v3] = num
			end
		end
	end
end

-- Handler
local EventHandler = S.CreateEventHandler()
EventHandler.Event.INITIALIZE = OnInitialize
EventHandler.Event.PLAYER_LOGIN = OnPlayerLogin
EventHandler.Register()
